app/views/folders/_folder.html.erb

            <%= link_to 'Add document', new_folder_document_path(folder), remote:true, class: "new-doc" %><br>
            <% if folder.documents.any? %>
---
SELECT "documents".* FROM "documents" WHERE "documents"."folder_id" = $1  [["folder_id", 20]]
SELECT 1 AS one FROM "documents" WHERE "documents"."folder_id" = $1 LIMIT $2  [["folder_id", 20], ["LIMIT", 1]]