app/views/folders/destroy.js.erb

$('.delete').bind('ajax:success', function() {
    $(this).closest('tr').fadeOut();
    $('.alert-text').text("Folder successfully deleted");
    $('.alert-text').fadeIn();
    $('.alert-text').fadeOut(4000);
});
---
DELETE FROM "folders" WHERE "folders"."id" = $1  [["id", 2]]