app/views/documents/_document.html.erb

        <%= content_tag :span, "#{document.title} (#{time_ago_in_words document.created_at} ago)", class: "document-title" %>
        <%= link_to "Delete document", [current_user.folders.find(document.folder_id), document], method: :delete, remote:true, class: "delete-doc" %>
---
SELECT "folders".* FROM "folders" WHERE "folders"."user_id" = $1 AND "folders"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]