app/views/documents/destroy.js.erb

$('.delete-doc').bind('ajax:success', function() {
    $(this).parent().fadeOut();
    $('.alert-text').text("Document sucessfully deleted");
    $('.alert-text').fadeIn();
    $('.alert-text').fadeOut(5000);
});
---
DELETE FROM "documents" WHERE "documents"."id" = $1  [["id", 33]]