app/controllers/documents_controller.rb

INSERT INTO "documents" ("title", "folder_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Patent case"], ["folder_id", 11], ["created_at", "2020-07-11 10:14:09.091523"], ["updated_at", "2020-07-11 10:14:09.091523"]]
---
    def create

        @document = @folder.documents.new(document_params)

        if params[:document][:pdf]
            @document.content_type = params[:document][:pdf].content_type
        end

        @document.save