app/controllers/documents_controller.rb

    def create
        # init new doc object
        @document = @folder.documents.new(document_params)
        # generate url compatible with Net::HTTP
        if @document.url
            escaped = URI.escape("http://boilerpipe-web.appspot.com/extract?url=#{@document.url}&output=text")
            uri = URI.parse(escaped)
            # for manual scraping:
                # html = Net::HTTP.get(uri)
                # text = Nokogiri::HTML(html).text
            # scrape text through boilerpipe api
            text = Net::HTTP.get(uri).gsub("\n"," ")
            @document.text = text
        end

        if @document.save
---
INSERT INTO "documents" ("title", "url", "text", "folder_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def destroy
        @document = @folder.documents.find(params[:id])
        @document.destroy
---
SELECT "documents".* FROM "documents" WHERE "documents"."folder_id" = $1 AND "documents"."id" = $2 LIMIT $3  [["folder_id", 11], ["id", 49], ["LIMIT", 1]]
DELETE FROM "documents" WHERE "documents"."id" = $1  [["id", 49]]

    def set_folder
        @folder = Folder.find(params[:folder_id])
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]