app/controllers/folders_controller.rb

SELECT "folders".* FROM "folders" WHERE "folders"."user_id" = $1 AND "folders"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def index
    @folders = current_user.folders.all

INSERT INTO "folders" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test"], ["created_at", "2020-07-10 14:23:08.767488"], ["updated_at", "2020-07-10 14:23:08.767488"], ["user_id", 1]]
---
  def create
    @folder = current_user.folders.new(folder_params)

    respond_to do |format|
      if @folder.save

DELETE FROM "folders" WHERE "folders"."id" = $1  [["id", 2]]
---
  def destroy
    @folder.destroy

SELECT "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_folder
      @folder = Folder.find(params[:id])