app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Ali"], ["password_digest", "$2a$12$RuDkPHrjJ5KToDCxvLH0N./JiPbtHEau0JU1fzNBpg/TcjKKGTNEa"], ["created_at", "2020-07-10 14:07:00.632681"], ["updated_at", "2020-07-10 14:07:00.632681"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save